import * as React from 'react';
import {SvgCss} from 'react-native-svg';

const xml = `
  <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" width="23.157" height="17.497" viewBox="0 0 23.157 17.497">
    <g id="noun_Image_1570203" opacity="0.8">
      <g id="グループ_313" data-name="グループ 313">
        <path id="パス_172" data-name="パス 172" d="M6.544,968.362A1.552,1.552,0,0,0,5,969.906v14.409a1.552,1.552,0,0,0,1.544,1.544h20.07a1.552,1.552,0,0,0,1.544-1.544V969.906a1.552,1.552,0,0,0-1.544-1.544Zm0,1.029h20.07a.5.5,0,0,1,.515.515v12.3l-4.511-4.937a.522.522,0,0,0-.756,0l-3.683,3.908-5.331-5.958a.525.525,0,0,0-.466-.169.519.519,0,0,0-.3.161l-6.055,6.5V969.906A.5.5,0,0,1,6.544,969.391Zm11.836,2.573a2.058,2.058,0,1,0,2.058,2.058A2.066,2.066,0,0,0,18.38,971.964Zm0,1.029a1.029,1.029,0,1,1-1.029,1.029A1.022,1.022,0,0,1,18.38,972.993Zm-5.926,3.337,7.607,8.5H6.544a.5.5,0,0,1-.515-.515v-1.086Zm9.777,2.05,4.9,5.355v.579a.5.5,0,0,1-.515.515h-5.17l-2.573-2.879Z" transform="translate(-5 -968.362)" fill="currentColor"/>
      </g>
    </g>
  </svg>
`;

export default ({width, height, color}) => (
  <SvgCss xml={xml} width={width} height={height} color={color} />
);
